Revit 2026 API

# WireIsVertexPointValid Method

---

Checks if the given vertex point can be added to this wire.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsVertexPointValid(
	XYZ vertexPoint
)
```
```vb
Public Function IsVertexPointValid (
	vertexPoint As XYZ
) As Boolean
```
```cpp
public:
bool IsVertexPointValid(
	XYZ^ vertexPoint
)
```
```fsharp
member IsVertexPointValid :
        vertexPoint : XYZ -> bool
```

#### Parameters

vertexPoint XYZ
     The vertex point.

#### Return Value

Boolean True if the vertex point can be added, false if the point cannot be added because there is already a vertex at this position on the view plane (within tolerance).

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Vertices are projected to the view plane for comparison.

#### Reference

Wire Class

Autodesk.Revit.DB.Electrical Namespace